---
kind: property
id: P:Autodesk.Revit.UI.UISaveAsOptions.ShowOverwriteWarning
source: html/53631747-5dfe-0821-3a4b-009ed482521f.htm
---
# Autodesk.Revit.UI.UISaveAsOptions.ShowOverwriteWarning Property

Identifies if UI should show an overwrite warning dialog.

## Syntax (C#)
```csharp
public bool ShowOverwriteWarning { get; set; }
```